# Pandas (Series)

In [1]:
import pandas as pd

In [2]:
airport=pd.Series(['pavan','ankit','sweety','anil','sona'])
airport

0     pavan
1     ankit
2    sweety
3      anil
4      sona
dtype: object

In [3]:
airport[3]

'anil'

In [4]:
for item in airport:
    print(item)

pavan
ankit
sweety
anil
sona

# DataFrame

most of the time working with pandas we are dealing with two dimensional arrays

The pandas DataFrame can store two dimensional arrays

In [5]:
airports=pd.DataFrame([
                      ['pavan','barnala','punjab'],
                      ['ankit','bathinda','punjab'],
                      ['sweety','bathinda','punjab'],
                      ['sona','hydrabad','AP'],
                      ['anil','AFA','telangana']],
                      columns=['Name','City','State']
                     )
airports

     Name      City      State
0   pavan   barnala     punjab
1   ankit  bathinda     punjab
2  sweety  bathinda     punjab
3    sona  hydrabad         AP
4    anil       AFA  telangana

# Returning first n rows

if you have thousands of rows and you want to look for first few rows

:)  head(n) returns the first n rows

In [6]:
airports.head(2)

    Name      City   State
0  pavan   barnala  punjab
1  ankit  bathinda  punjab

# Returning last n rows

looking at the last few rows can be good to be sure that all your data loaded correctly

:) tail(n) returns last n rows

In [7]:
airports.tail(3)

     Name      City      State
2  sweety  bathinda     punjab
3    sona  hydrabad         AP
4    anil       AFA  telangana

# Checking number of rows and columns in dataframe

->Sometimes you just need to know how much data you have in dataframes

->Shape returns the no. of rows and columns

In [8]:
airports.shape

(5, 3)

# Getting more detailed information about DataFrame contents

->info() returns more detailed information about DataFrames

Information returned includes:

->The number of rows  and range of index values.

->The number of columns.

->For each column: Column name,number of null-values in column, data-type

In [9]:
airports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   City    5 non-null      object
 2   State   5 non-null      object
dtypes: object(3)
memory usage: 248.0+ bytes

# Return one entire column

specify the name of the column you want to return

data_frame_name ['column name']

In [10]:
airports['State']

0       punjab
1       punjab
2       punjab
3           AP
4    telangana
Name: State, dtype: object

# Return multiple columns

provide the list of column names that you might want to return 

data_frame_name[['column name','column_name',....]]

In [11]:
airports[['City','State']]

       City      State
0   barnala     punjab
1  bathinda     punjab
2  bathinda     punjab
3  hydrabad         AP
4       AFA  telangana

# use iloc to return rows and columns

iloc allows you to return a specific element or a group of rows and columns

specify the row and colmn you want to return

In [12]:
airports.iloc[:,:]

     Name      City      State
0   pavan   barnala     punjab
1   ankit  bathinda     punjab
2  sweety  bathinda     punjab
3    sona  hydrabad         AP
4    anil       AFA  telangana

In [13]:
airports.iloc[0:3,:]

     Name      City   State
0   pavan   barnala  punjab
1   ankit  bathinda  punjab
2  sweety  bathinda  punjab

In [14]:
airports.iloc[0:3,0:2]

     Name      City
0   pavan   barnala
1   ankit  bathinda
2  sweety  bathinda

In [15]:
airports.iloc[:,[0,2]]

     Name      State
0   pavan     punjab
1   ankit     punjab
2  sweety     punjab
3    sona         AP
4    anil  telangana

# use loc to  specify columns by name

if you want to list the column name instead of indexing them use loc

In [16]:
airports.loc[:,['Name','State']]

     Name      State
0   pavan     punjab
1   ankit     punjab
2  sweety     punjab
3    sona         AP
4    anil  telangana